In [13]:
import pandas as pd

In [14]:
url = 'https://raw.githubusercontent.com/lenhattung/SP26-AI1904-DAP391m/refs/heads/main/lab_part_2/01%20-%20Linear%20and%20logistic%20regression/titanic.csv'
df = pd.read_csv(url)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1309 non-null   int64
 1   pclass        1309 non-null   int64
 2   survived      1309 non-null   int64
 3   name          1309 non-null   object
 4   sex           1309 non-null   int64
 5   age           1046 non-null   float64
 6   sibsp         1309 non-null   int64
 7   parch         1309 non-null   int64
 8   ticket        1309 non-null   object
 9   fare          1308 non-null   float64
 10  cabin         295 non-null    object
 11  embarked      1307 non-null   object
 12  boat          486 non-null    object
 13  body          121 non-null    float64
 14  home.dest     745 non-null    object
dtypes: float64(3), int64(6), object(6)
memory usage: 153.5+ KB

In [16]:
df.head()

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,1,"Allen, Miss. Elisabeth Walton",1,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,2,1,1,"Allison, Master. Hudson Trevor",0,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,3,1,0,"Allison, Miss. Helen Loraine",1,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,4,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,5,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [17]:
df['survived'] = df['survived'].replace({1 : 'Yes' , 0 : 'No'})
df['sex'] = df['sex'].replace({1 : 'Male', 0 : 'Female'})
df.head()

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,Yes,"Allen, Miss. Elisabeth Walton",Male,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,2,1,Yes,"Allison, Master. Hudson Trevor",Female,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,3,1,No,"Allison, Miss. Helen Loraine",Male,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,4,1,No,"Allison, Mr. Hudson Joshua Creighton",Female,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,5,1,No,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Male,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [95]:
df = df.sort_values(by = 'pclass', ascending = True)
df['pclass'] = df['pclass'].replace({1 : '1st', 2 : '2nd', 3 : '3rd'})
df.sample(10)

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
708,709,3rd,No,"Carlsson, Mr. Carl Robert",Female,24.0,0,0,350409,7.8542,NaN,S,NaN,NaN,"Goteborg, Sweden Huntley, IL"
284,285,1st,Yes,"Stone, Mrs. George Nelson (Martha Evelyn)",Male,62.0,0,0,113572,80.0000,B28,NaN,6,NaN,"Cincinatti, OH"
1117,1118,3rd,No,"Pekoniemi, Mr. Edvard",Female,21.0,0,0,STON/O 2. 3101294,7.9250,NaN,S,NaN,NaN,NaN
896,897,3rd,No,"Johnson, Mr. Alfred",Female,49.0,0,0,LINE,0.0000,NaN,S,NaN,NaN,NaN
696,697,3rd,No,"Cacic, Miss. Manda",Male,21.0,0,0,315087,8.6625,NaN,S,NaN,NaN,NaN
912,913,3rd,No,"Karaic, Mr. Milan",Female,30.0,0,0,349246,7.8958,NaN,S,NaN,NaN,NaN
304,305,1st,Yes,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",Male,60.0,1,0,110813,75.2500,D37,C,5,NaN,"Portland, OR"
664,665,3rd,Yes,"Barah, Mr. Hanna Assi",Female,20.0,0,0,2663,7.2292,NaN,C,15,NaN,NaN
429,430,2nd,No,"Harbeck, Mr. William H",Female,44.0,0,0,248746,13.0000,NaN,S,NaN,35.0,"Seattle, WA / Toledo, OH"
1144,1145,3rd,No,"Rice, Master. Eugene",Female,2.0,4,1,382652,29.1250,NaN,Q,NaN,NaN,NaN

In [101]:
df['age'].round(0)

50      58.0
259     34.0
258     30.0
257     35.0
256      NaN
        ...
1030     NaN
814     25.0
822     41.0
748     34.0
604     16.0
Name: age, Length: 1309, dtype: float64

In [102]:
df['embarked'].unique()

array(['C', 'S', nan, 'Q'], dtype=object)

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 50 to 604
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1309 non-null   int64
 1   pclass        1309 non-null   object
 2   survived      1309 non-null   object
 3   name          1309 non-null   object
 4   sex           1309 non-null   object
 5   age           1046 non-null   float64
 6   sibsp         1309 non-null   int64
 7   parch         1309 non-null   int64
 8   ticket        1309 non-null   object
 9   fare          1308 non-null   float64
 10  cabin         295 non-null    object
 11  embarked      1307 non-null   object
 12  boat          486 non-null    object
 13  body          121 non-null    float64
 14  home.dest     745 non-null    object
dtypes: float64(3), int64(3), object(9)
memory usage: 163.6+ KB

In [104]:
df['body']

50        NaN
259       NaN
258       NaN
257       NaN
256       NaN
        ...
1030      NaN
814       NaN
822       NaN
748     197.0
604       NaN
Name: body, Length: 1309, dtype: float64